0.1.0/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     simple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;
writeControl    runTime;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
functions
{
  forces
  {
    type                forces;
    functionObjectLibs  ( "libforces.so" );
    outputControl       timeStep;
    outputInterval      10;
    patches             (wing);
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
    rhoInf              1;
    CofR                (0.4974612746 -0.01671895744 0.125);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
