0.1.0/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/system/createPatchDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      createPatchDict;
}

pointSync false;
patches
(
  {
    // Name of new patch
    name front;
    // Type of new patch
    patchInfo
    {
      type empty;
    }
    // How to construct: either from 'patches' or 'set'
    constructFrom patches;
    // If constructFrom = patches : names of patches. Wildcards allowed.
    patches (symFront);
  }
  {
    // Name of new patch
    name back;
    // Type of new patch
    patchInfo
    {
      type empty;
    }
    // How to construct: either from 'patches' or 'set'
    constructFrom patches;
    // If constructFrom = patches : names of patches. Wildcards allowed.
    patches (symBack);
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
