0.1.0/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      turbulenceProperties;
}

simulationType RAS;
RAS
{
  RASModel        kOmegaSST;
  turbulence      on;
  printCoeffs     on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
