0.1.0/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  wing
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  "(front|back|topAndBottom|inlet|outlet)"
  {
    type            calculated;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
