0.1.0/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}

solvers
{
  p
  {
    solver           GAMG;
    tolerance        1e-7;
    relTol           0.1;
    smoother         GaussSeidel;
    nPreSweeps       0;
    nPostSweeps      2;
    cacheAgglomeration on;
    agglomerator     faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels      1;
  }
  U
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
  k
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
  omega
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    "(U|k|omega)"   0.7;
    "(U|k|omega)Final" 1.0;
  }
}
cache
{
  grad(U);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
